import { Pipe, PipeTransform } from '@angular/core';

@Pipe({
  name: 'typerub',
})
export class MyPipe implements PipeTransform {
  public states: Object = {
    '0':   'ไม่ระบุ',
    '1':   'อื่นๆ',
    '2':   'ยางแผ่นรมควัน',
    '3': 'ยางแผ่นรมควัน,อื่นๆ',
    '4':  'ยางแผ่นดิบ',
    '5': 'ยางแผ่นดิบ,อื่นๆ',
    '6': 'ยางแผ่นรมควัน,ยางแผ่นดิบ',
    '8':  'ยางก้อนถ้วย',
    '9': 'ยางก้อนถ้วย,อื่น',
    '10': 'ยางแผ่นรมควัน,ยางก้อนถ้วย',
    '12': 'ยางแผ่นดิบ,ยางก้อนถ้วย',
    '13': 'ยางแผ่นดิบ,ยางก้อนถ้วย,อื่นๆ',
    '14': 'ยางแผ่นรมควัน,ยางแผ่นดิบ,ยางก้อนถ้วย',
    '16':  'น้ำยางสด',
    '17':  'น้ำยางสด,อื่นๆ',
    '18':  'น้ำยางสด,ยางแผ่นรมควัน',
    '20':  'น้ำยางสด,ยางแผ่นดิบ',
    '22':  'น้ำยางสด,ยางแผ่นดิบ',
    '24':  'น้ำยางสด,ยางก้อนถ้วย',
    '25':  'น้ำยางสด,ยางก้อนถ้วย,อื่นๆ',
    '26':  'ยางแผ่นรมควัน,น้ำยางสด,ยางก้อนถ้วย',
    '28':  'ยางแผ่นดิบ,น้ำยางสด,ยางก้อนถ้วย',
    '29':  'ยางแผ่นดิบ,น้ำยางสด,ยางก้อนถ้วย,อื่นๆ',
    '30':  'ยางแผ่นรมควัน,ยางแผ่นดิบ,น้ำยางสด,ยางก้อนถ้วย'
  };
  transform(value: string, ...args) {
    if(value == null) return;
    if(this.states[value]){
      return this.states[value];
    } else {
      return value;
    }
  }
}
